app/controllers/school_classes_controller.rb

   def update
      @school_class = SchoolClass.find(params[:id])
      @school_class.update(school_class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Chemistry"], ["updated_at", "2020-12-14 13:39:53.412318"], ["id", 3]]